viv_from_beginning/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1600;
        startFace       46000;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       47600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       48000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       48400;
    }
    top
    {
        type            patch;
        nFaces          800;
        startFace       49200;
    }
)

// ************************************************************************* //
